W7/W7D3/music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
        <option></option>
        <% Band.all.each do |band| %>