W7/W7D3/music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def new
        @band = Band.find_by(id: params[:band_id])

INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 2], ["title", "Lala"], ["year", 2000], ["created_at", "2022-07-06 20:03:33.887741"], ["updated_at", "2022-07-06 20:03:33.887741"]]
---
    def create
        @album = Album.new(album_params)
        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @album = Album.find_by(id: params[:id])