W7/W7D3/music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @album = Album.find(params[:album_id])

INSERT INTO "tracks" ("album_id", "title", "ord", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_id", 1], ["title", "First song"], ["ord", 1], ["created_at", "2022-07-06 20:34:19.016421"], ["updated_at", "2022-07-06 20:34:19.016421"]]
---
    def create
        @track = Track.new(track_params)
        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @track = Track.find_by(id: params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "song song"], ["updated_at", "2022-07-06 20:40:42.828632"], ["id", 1]]
---
    def update
        @track = Track.find(params[:id])
        if @track.update(track_params)