W7/W7D3/music_app/app/views/tracks/edit.html.erb

        <option></option>
        <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"