W7/W7D3/music_app/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "BGSksvg7Yvg6CH2VLPhCEQ"], ["updated_at", "2022-07-06 17:44:55.092577"], ["id", 1]]